api/artillery-load-test.yml
config:
  target: http://localhost:8080
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
  phases:
    - duration: 600
      arrivalRate: 1
      maxVusers: 1000
      name: Warm up phase
    - duration: 600
      arrivalRate: 10
      maxVusers: 5000
      name: Ramp up load
    - duration: 600
      arrivalRate: 100
      maxVusers: 10000
      name: Spike phase
  environments:
    prod:
      target: http://api-prod-342430507.us-east-1.elb.amazonaws.com
    staging:
      target: http://api-staging-770293556.us-east-1.elb.amazonaws.com
    dev:
      target: http://api-dev-1839587515.us-east-1.elb.amazonaws.com
  plugins:
    expect:
      outputFormat: prettyError
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - name: health
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
  - name: docs
    flow:
      - get:
          url: "/docs"
          expect:
            - statusCode: 200
  - name: search
    flow:
      - post:
          url: "/v0/opportunities/search"
          headers:
            X-Auth: "{{ $env.API_AUTH_TOKEN }}"
          json:
            paging:
              page_offset: 1
              page_size: 25
            sorting:
              order_by: opportunity_id
              sort_direction: ascending
          expect:
            - statusCode: 200